Revit 2027 API
PipingSystemType.TwoLineDropType Property
 Symbol for a 2 line drop
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RiseDropSymbol TwoLineDropType { get; set; }
Public Property TwoLineDropType As RiseDropSymbol
	Get
	Set
public:
property RiseDropSymbol TwoLineDropType {
	RiseDropSymbol get ();
	void set (RiseDropSymbol value);
}
member TwoLineDropType : RiseDropSymbol with get, set
Property Value
RiseDropSymbol
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input is not a valid piping rise/drop symbol type.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace